app/Controllers/ApplicationController.php

SELECT *
FROM `departments`
ORDER BY `department_name` ASC
SELECT *
FROM `technologies`
ORDER BY `technology_name` ASC
---
    public function edit($id)
    {
        if (!session()->get('user_id')) {
            return redirect()->to('login');
        }

        if (session()->get('usertype') !== 'superadmin') {
            return redirect()->to('dashboard')->with('error', 'Unauthorized access');
        }

        $data['application'] = $this->applicationModel->getWithDepartment($id);

        if (!$data['application']) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException("Application $id not found");
        }

        $data['statuses'] = $this->statusModel->orderBy('status_name', 'ASC')->findAll();
        $data['departments'] = $this->departmentModel->orderBy('department_name', 'ASC')->findAll();
        $data['technologies'] = $this->technologyModel->orderBy('technology_name', 'ASC')->findAll();

SELECT *
FROM `applications`
WHERE `applications`.`id` = '3'
---
    public function update($id)
    {
        if (!session()->get('user_id')) {
            return redirect()->to('login');
        }

        if (session()->get('usertype') !== 'superadmin') {
            return redirect()->to('dashboard')->with('error', 'Unauthorized access');
        }

        $application = $this->applicationModel->find($id);