app/Controllers/ApplicationController.php

    public function delete($id)
    {
        if (!session()->get('user_id')) {
            return redirect()->to('login');
        }

        if (session()->get('usertype') !== 'superadmin') {
            return redirect()->to('dashboard')->with('error', 'Unauthorized access');
        }

        $application = $this->applicationModel->find($id);
        if (!$application) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException("Application $id not found");
        }

        // Log the action
        $this->logModel->insert([
            'application_id' => $id,
            'action' => 'Application Deleted',
            'performed_by' => session()->get('user_name') ?? 'System',
            'action_date' => date('Y-m-d H:i:s'),
        ]);

        if ($this->applicationModel->delete($id)) {
---
SELECT *
FROM `applications`
WHERE `applications`.`id` = '1'
DELETE FROM `applications`
WHERE `id` IN ('1')