app/Controllers/UnitController.php

SELECT *
FROM `units`
ORDER BY `id` DESC
---
    public function index()
    {
        if (!session()->get('user_id')) {
            return redirect()->to('login');
        }

        $unitModel = new Unit();
        $data['units'] = $unitModel->orderBy('id', 'DESC')->findAll();