app/Models/ApplicationContactsExtended.php

SELECT *
FROM `application_contacts_extended`
WHERE `application_id` = '3'
ORDER BY `is_primary` DESC, `id` DESC
---
    public function getContactsByApplication($applicationId, $role = null)
    {
        $query = $this->where('application_id', $applicationId);
        if ($role) {
            $query->where('role', $role);
        }
        return $query->orderBy('is_primary', 'DESC')->orderBy('id', 'DESC')->findAll();