app/Models/ApplicationEnvironments.php

SELECT *
FROM `application_environments`
WHERE `application_id` = '3'
ORDER BY `environment_type` ASC
---
    public function getEnvironmentsByApplication($applicationId)
    {
        return $this->where('application_id', $applicationId)
                   ->orderBy('environment_type', 'ASC')
                   ->findAll();