app/Models/ApplicationDependencies.php

    public function getDependenciesByApplication($applicationId, $type = null)
    {
        $query = $this->where('application_id', $applicationId);
        if ($type) {
            $query->where('dependency_type', $type);
        }
        return $query->orderBy('is_critical', 'DESC')->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `application_dependencies`
WHERE `application_id` = '3'
ORDER BY `is_critical` DESC, `id` DESC