app/Models/ApplicationVendors.php

SELECT *
FROM `application_vendors`
WHERE `application_id` = '3'
ORDER BY `vendor_name` ASC
---
    public function getVendorsByApplication($applicationId)
    {
        return $this->where('application_id', $applicationId)
                   ->orderBy('vendor_name', 'ASC')
                   ->findAll();