app/Models/BatchJobs.php

    public function getJobsByApplication($applicationId, $status = null)
    {
        $query = $this->where('application_id', $applicationId);
        if ($status) {
            $query->where('job_status', $status);
        }
        return $query->orderBy('job_name', 'ASC')->findAll();
---
SELECT *
FROM `batch_jobs`
WHERE `application_id` = '3'
ORDER BY `job_name` ASC