app/Models/ComplianceSecurity.php

    public function getComplianceByApplication($applicationId)
    {
        return $this->where('application_id', $applicationId)->first();
---
SELECT *
FROM `compliance_security`
WHERE `application_id` = '3'
 LIMIT 1