app/Models/InfrastructureDetails.php

SELECT *
FROM `infrastructure_details`
WHERE `application_id` = '3'
 LIMIT 1
---
    public function getInfrastructureByApplication($applicationId)
    {
        return $this->where('application_id', $applicationId)->first();