app/Models/LicensingInfo.php

SELECT *
FROM `licensing_info`
WHERE `application_id` = '3'
 LIMIT 1
---
    public function getLicensingByApplication($applicationId)
    {
        return $this->where('application_id', $applicationId)->first();