app/Models/OperationalMetrics.php

    public function getMetricsByApplication($applicationId)
    {
        return $this->where('application_id', $applicationId)->first();
---
SELECT *
FROM `operational_metrics`
WHERE `application_id` = '3'
 LIMIT 1