app/Models/TechnologyDetails.php

    public function getTechDetailsByApplication($applicationId)
    {
        return $this->where('application_id', $applicationId)->first();
---
SELECT *
FROM `technology_details`
WHERE `application_id` = '3'
 LIMIT 1